# Desafío - Introducción al ambiente de trabajo (Sebastián Rebolledo)

**Desafio 1**

In [1]:
print("Hola Mundo, esta es mi primera incursión en Python")

Hola Mundo, esta es mi primera incursión en Python

**Desafio 2**

In [39]:
nombre = "Sebastian Rebolledo"
edad = 26
actividades = ["Andar en bicicleta", "Jugar videojuegos", "Leer"]
mascota = True

**Desafio 3**

In [40]:
print(nombre)
print(edad)
print(actividades[1])
print(mascota)

Sebastian Rebolledo
26
Jugar videojuegos
True

In [41]:
print(type(nombre))
print(type(edad))
print(type(actividades))
print(type(mascota))

<class 'str'>
<class 'int'>
<class 'list'>
<class 'bool'>

In [ ]:
if mascota == True:
    mascota = "si"

In [44]:
presentacion = f"Hola me llamo {nombre}, tengo {edad} años, y mis actividades favoritas son : {actividades[0]}, {actividades[1]} y {actividades[2]} y {mascota} tengo una mascota llamada nieve."

In [45]:
print(presentacion)

Hola me llamo Sebastian Rebolledo, tengo 26 años, y mis actividades favoritas son : Andar en bicicleta, Jugar videojuegos y Leer y True tengo una mascota llamada nieve.

**Desafio 4**

Codigo a corregir:

In [17]:
print('Estaba la pájara pinta sentada en el verde limón)

SyntaxError: EOL while scanning string literal (<ipython-input-17-d2445c7a277d>, line 1)

El error se produce por que falta la comilla simple al final del string. A continuacion dejo el codigo corregido

In [18]:
print('Estaba la pájara pinta sentada en el verde limón')

Estaba la pájara pinta sentada en el verde limón

Codigo a corregir:

In [19]:
print('Mi nombre es' name 'y tengo' edad, 'años')

SyntaxError: invalid syntax (<ipython-input-19-d4c6d8abefec>, line 1)

El error se debe a que le faltan las comas ademas de que la variable name no esta definida.

Para corregirlo agregare las comillas y le asignare un valor a la variable name.

In [25]:
name = "Sebastian"
print('Mi nombre es', name, 'y tengo', edad, 'años')

Mi nombre es Sebastian y tengo 26 años

Codigo a corregir:

In [26]:
import padnas as pd
import nunnpy as np

ModuleNotFoundError: No module named 'padnas'

El error se debe a que estan mal escritos los dos modulos, numpy y pandas.

In [27]:
import pandas as pd
import numpy as np

Codigo a corregir:

In [28]:
"Ornitorrinco" + 45

TypeError: can only concatenate str (not "int") to str

No se pueden sumar string con enteros (int)

**Desafio 5**

In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("flights.csv")
df

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [5]:
df.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [6]:
df.tail()

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [8]:
medidas_univariadas = df["year"].describe()

In [9]:
medidas_univariadas

count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
25%      1951.750000
50%      1954.500000
75%      1957.250000
max      1960.000000
Name: year, dtype: float64

In [25]:
frecuencia = df.value_counts()
frecuencia

year  month      passengers
1949  April      129           1
      August     148           1
1956  May        318           1
      November   271           1
      October    306           1
                              ..
1953  April      235           1
      August     272           1
      December   201           1
      February   196           1
1960  September  508           1
Length: 144, dtype: int64

In [33]:
primeras_15 = df.head(15)
ultimos_15 = df.tail(15)

Media, mediana y moda, para la columna passengers

In [20]:
media_pasajeros = np.mean(df["passengers"])
media_pasajeros

280.2986111111111

In [21]:
mediana_pasajeros = np.median(df["passengers"])
mediana_pasajeros

265.5

In [26]:
desviacion_standar_pasajeros = np.std(df["passengers"])
desviacion_standar_pasajeros

119.54904153277148

Media, mediana y moda, para los primeros y ultimos 15 elementos de la columna passenger

In [28]:
media_primeros_15 = np.mean(primeras_15["passengers"])
media_primeros_15

126.8

In [30]:
mediana_primeros_15 = np.median(primeras_15["passengers"])
mediana_primeros_15

126.0

In [31]:
std_primeros_15 = np.std(primeras_15["passengers"])
std_primeros_15

12.681745410891462

In [34]:
media_ultimos_15 = np.mean(ultimos_15["passengers"])
media_ultimos_15

459.2

In [35]:
mediana_ultimos_15 = np.median(ultimos_15["passengers"])
mediana_ultimos_15

432.0

In [37]:
std_ultimos_15 = np.std(ultimos_15["passengers"])
std_ultimos_15

75.29426715671431

Se puede apreciar el aumento de pasajeros viajando al comparar las medidas de tendencia central obtenidas en los primeros 15 datos con respecto  a los ultimos.